text/chart_style/tdd_leap_year/tdd_rspec_leap.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="jp" xml:lang="jp">
<head>
<!-- 2019-10-07 月 11:24 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>tdd to rspec</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Shigeto R. Nishitani" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">tdd to rspec</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org41f27ea">1. specとしたら</a></li>
<li><a href="#orgbb971b9">2. rspecの掟</a></li>
<li><a href="#org2f5f29f">3. 注：あるいは研究課題</a></li>
</ul>
</div>
</div>

<div id="outline-container-org41f27ea" class="outline-2">
<h2 id="org41f27ea"><span class="section-number-2">1</span> specとしたら</h2>
<div class="outline-text-2" id="text-1">
<p>
では，どう書けばいいでしょう？
できるだけ人が読んでわかる情報をおきたいですよね．
</p>
<pre class="example">
leap?関数は年を受け取って，うるう年かどうかを真偽値で返す．
[2004, 1999, 1900, 2000]に対して[true, false, false, true]を返す．
</pre>
<p>
となるでしょう．
</p>

<p>
こいつをrspecというtesting frameworkで実装すると
</p>
<ul class="org-ul">
<li><a href="./check_leap/check_leap_spec.rb">./check_leap/check_leap_spec.rb</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-ruby">describe <span style="font-style: italic;">"leap?"</span> <span style="font-weight: bold;">do</span>
  it <span style="font-style: italic;">'check the year leap or not'</span> <span style="font-weight: bold;">do</span>
    expected = [<span style="font-weight: bold; font-style: italic;">true</span>, <span style="font-weight: bold; font-style: italic;">false</span>, <span style="font-weight: bold; font-style: italic;">false</span>, <span style="font-weight: bold; font-style: italic;">true</span>]
    [2004, 1999, 1900, 2000].each_with_index <span style="font-weight: bold;">do</span> |year, i|
      print year.to_s+<span style="font-style: italic;">", "</span>
      expect(leap?(year)).to eq expected[i]
    <span style="font-weight: bold;">end</span>
  <span style="font-weight: bold;">end</span>
<span style="font-weight: bold;">end</span>
</pre>
</div>
<p>
となります．DSL(domain specific language)なんでrubyの文法からは
外れていますが，なんとなく上に書いたleap?の仕様にならっているのが
わかります？　
</p>

<p>
rubyではなくrspecで走らせてみると，
</p>
<div class="org-src-container">
<pre class="src src-ruby">&gt; rspec check_leap_spec.rb
leap?
2004, 1999, 1900, 2000,   check the year leap <span style="font-weight: bold;">or</span> <span style="font-weight: bold;">not</span>

<span style="font-weight: bold; text-decoration: underline;">Finished</span> <span style="font-weight: bold;">in</span> 0.00312 seconds (files took 0.13577 seconds to load)
1 example, 0 failures
</pre>
</div>
<p>
となります．rspecがないと怒られた人は，
</p>
<pre class="example">
gem install rspec

</pre>
<p>
してください．
</p>

<p>
この時，
</p>
<pre class="example">
# .rspec
#--format Fuubar
--format documentation
--color
</pre>
<p>
として少し「みば」をよくしています．
こいつの設定は大津がバリバリなんで，takaki0403に問い合わせてください．
</p>
</div>
</div>

<div id="outline-container-orgbb971b9" class="outline-2">
<h2 id="orgbb971b9"><span class="section-number-2">2</span> rspecの掟</h2>
<div class="outline-text-2" id="text-2">
<p>
ここまでくると，このままでは少し困難が生じてきます．
rubyで走らせようとするとおかしくなります．
</p>
<pre class="example">
&gt; ruby check_leap_spec.rb 
check_leap_spec.rb:17:in `&lt;main&gt;': undefined method `describe' for main:Object (NoMethodError)
</pre>
<p>
main の部分をrspecに合うように変えましたから．．．そこで
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">実行目的</td>
<td class="org-left">コマンド</td>
<td class="org-left">コード</td>
</tr>

<tr>
<td class="org-left">code(lib)</td>
<td class="org-left">require 'hoge'</td>
<td class="org-left"><a href="./check_leap/lib/check_leap.rb">./check_leap/lib/check_leap.rb</a></td>
</tr>

<tr>
<td class="org-left">application(cli)</td>
<td class="org-left">exe/hoge</td>
<td class="org-left"><a href="./check_leap/exe/check_leap">./check_leap/exe/check_leap</a></td>
</tr>

<tr>
<td class="org-left">test</td>
<td class="org-left">rspec spec/hoge_test.rb</td>
<td class="org-left"><a href="./check_leap/spec/check_leap_spec.rb">./check_leap/spec/check_leap_spec.rb</a></td>
</tr>
</tbody>
</table>

<p>
とします．こいつはシステムが大きくなって，code書く人とテストする人が
別れて来ると重要になります．粒度の話をどこかでするんですが，
コンピュータ言語を習得する時に，小さい単位から
</p>
<ol class="org-ol">
<li>文法</li>
<li>熟語，イディオム</li>
<li>method</li>
<li>class</li>
<li>pattern</li>
</ol>
<p>
などという大きなサイズまで習得すべきスキルとか，デザインが変わってきます．
このサイズのことを「粒度」と読んでいますが，これは建築の分野から入ってきた
概念です．
</p>

<p>
で，小さい粒度で仕事している間は，置き場所とかframeとかは無視してもいいんですよ．
でもシステムが大きくなって分業が進むとそういうわけにも行きません．
大工さんはどこの粒度でもどこの現場でも同じ仕事をしますよね．
それが，掟ってやつです．
「守破離」て茶道や剣道にはありましたが，
それを今softwareの世界ではbest practiceって読んでいます．
おいおい，こういうスキルは身についてくるんで，
まずは「 <b>テスト駆動開発</b> っていうやり方がある」ことを心に留めておいてください．
</p>
</div>
</div>

<div id="outline-container-org2f5f29f" class="outline-2">
<h2 id="org2f5f29f"><span class="section-number-2">3</span> 注：あるいは研究課題</h2>
<div class="outline-text-2" id="text-3">
<p>
本当に置き場所を分散することがbest practiceなのかは考える必要があります．
programmerとtesterがいるから別れているのでしょうが，本来はprogrammerが
責任を持ってspecを書くべきです．それならば同じファイルの中でcode, exec, specが
ある方がいいのではないでしょうか．誰かそういうDSLを作ってくれると嬉しいんですが．．．
</p>

<pre class="example">
require ”hge.rb"
ruby hoge.rb
rspec hoge.rb
</pre>
<p>
で振る舞いが違うと最高！！
callerってのを使うと意外と楽に実装できるかも．．．
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Shigeto R. Nishitani</p>
<p class="date">Created: 2019-10-07 月 11:24</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
